posts/Emacs/iri.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IRI: An interactive Emacs front-end for Ruby API reference</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">IRI: An interactive Emacs front-end for Ruby API reference</h1>
<p>
I happened to write some <i>Ruby</i> code recently.  After years since I
had learned it (but not had been using later), I had to check <i>Ruby</i>
docs frequently.  Fortunately, <i>Ruby</i> was bundled with <i>ri</i>, which was
an offline, easy-to-use command-line tool to query <i>Ruby</i> APIs.  As an
Emacs user, I soon found myself looking for a front-end for <i>ri</i> so
that I could query <i>ri</i> without leaving my editor.
</p>

<p>
I first used <a href="https://github.com/hron/yari.el">yari.el</a> for a while.  Generally it was a good, popular
package (and actually the only "modern" choice as far as I known).  It
retrieves all classes known by <i>ri</i> when it is first invoked.  Then it
uses <code>completing-read</code> for my input.
</p>

<p>
However, I found it NOT as handy as I had expected. The default
completion was not handy enough because it took a <i>match-first</i>
strategy.  I had to type the class name before giving the method name
I was looking for.  Otherwise the completion would not match and in
this case <i>yari</i> also would not attempt to send the input to <i>ri</i> even
though <i>ri</i> actually was capable of searching for a method for all
known classes.
</p>

<p>
Take <code>strftime</code> as an example.  
</p>
<ul class="org-ul">
<li>For <i>yari</i>: If I typed "<code>strftime</code>" in the <i>yari</i> prompt and pressed
<code>&lt;RET&gt;</code>, "<code>[No match]</code>" was shown with no further query results.</li>
<li>For the native command-line <i>ri</i> tool: If I typed <code>"ri strftime"</code> in
a shell, the docs of <code>Date.strftime</code>, <code>DateTime.strftime</code>,
<code>Time.strftime</code> was shown.</li>
</ul>

<p>
To the rescue, <i>yari</i> could be used with <i>ido-mode</i> and was itself
shipped with several shrewd completion systems like <i>helm</i> and
<i>anything</i>.  Unfortunately, I was not into any complicated completion
systems nor was I to introduce one into my Emacs.
</p>

<p>
Surprisingly I kinda liked querying the native <i>ri</i>.  It was handy
enough to search my input and even smart enough to guess my typo.  For
example, if I typed "<code>mach</code>", <i>ri</i> replied
</p>

<pre class="example">
Nothing known about .mach
Did you mean?  match
</pre>

<p>
Since <i>ri</i> was already a good query tool, what I needed was just a
simple front-end talking to an inferior <i>ri</i> process.  I liked
<code>shell-mode</code>'s way to input, navigate, and search, I decided to
implement an interactive <code>shell-mode</code> -like front-end for <i>ri</i>.  It
turned out to be really simple and intuitive.  And I named it <i>iri</i>.
</p>

<p>
The project now can be found <a href="https://github.com/Raphus-cucullatus/iri">here</a>.  Hope you enjoy it!
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: Jul 14, 2019</p>
<p class="validation"></p>
</div>
</body>
</html>
